000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/СтатусыЗапросовДоступностиТоваровШапка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваровШапка</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаКассе</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезнал</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСогласован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтменуОтправитель</name>
  </enumValues>
  <enumValues>
    <name>Выдан</name>
  </enumValues>
  <enumValues>
    <name>ЧекВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ВыданДоставке</name>
  </enumValues>
  <enumValues>
    <name>ТоварВМагазине</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтменуПолучатель</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция СтатусОтменыДокумента(ПредыдущийСтатус) Экспорт
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый Тогда
	
		Результат = Отменён;
	
	Иначе
		
		Если ПредыдущийСтатус = ВРаботе
				Или ПредыдущийСтатус = Согласован
				Или ПредыдущийСтатус = Изменён
				Или ПредыдущийСтатус = Сборка
				Или ПредыдущийСтатус = КОтправке Тогда
			
			Результат = ПодтвердитьОтменуОтправитель;
			
		Иначе
			
			Результат = ПодтвердитьОтменуПолучатель;

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли
